In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
randn(3)

array([-0.31899844, -0.60651244,  0.0115352 ])

In [4]:
randn(3,3)

array([[-1.27756556, -0.26529808, -0.62057683],
       [-0.41800723,  1.51336574,  0.99838554],
       [-0.06537945, -0.03931435, -0.37186047]])

In [5]:
df = pd.DataFrame(data = randn(3,3), index = ["A","B","C"], columns = ["Column1","Column2","Column3"])

In [6]:
df

    Column1   Column2   Column3
A -0.957277  0.050216  0.375921
B  0.579557  1.121642  0.123859
C  0.040049 -0.057692 -1.013646

In [7]:
df["Column1"]

A   -0.957277
B    0.579557
C    0.040049
Name: Column1, dtype: float64

In [8]:
type(df["Column2"])

pandas.core.series.Series

In [9]:
df.loc["A"]

Column1   -0.957277
Column2    0.050216
Column3    0.375921
Name: A, dtype: float64

In [10]:
type(df.loc["A"])

pandas.core.series.Series

In [12]:
df[["Column1","Column3"]]

    Column1   Column3
A -0.957277  0.375921
B  0.579557  0.123859
C  0.040049 -1.013646

In [14]:
df

    Column1   Column2   Column3
A -0.957277  0.050216  0.375921
B  0.579557  1.121642  0.123859
C  0.040049 -0.057692 -1.013646

In [15]:
df["Column4"] = pd.Series(randn(3),["A","B","C"])

In [17]:
df

    Column1   Column2   Column3   Column4
A -0.957277  0.050216  0.375921  0.420434
B  0.579557  1.121642  0.123859 -2.358564
C  0.040049 -0.057692 -1.013646  1.141054

In [18]:
df["Column5"] = df["Column1"] + df["Column2"] + df["Column3"]

In [19]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.957277  0.050216  0.375921  0.420434 -0.531139
B  0.579557  1.121642  0.123859 -2.358564  1.825058
C  0.040049 -0.057692 -1.013646  1.141054 -1.031289

In [22]:
df.drop("Column5",axis = 1,inplace = True)

In [23]:
df

    Column1   Column2   Column3   Column4
A -0.957277  0.050216  0.375921  0.420434
B  0.579557  1.121642  0.123859 -2.358564
C  0.040049 -0.057692 -1.013646  1.141054

In [25]:
df["Column1"]

A   -0.957277
B    0.579557
C    0.040049
Name: Column1, dtype: float64

In [26]:
df.loc["A"]

Column1   -0.957277
Column2    0.050216
Column3    0.375921
Column4    0.420434
Name: A, dtype: float64

In [27]:
df.iloc[0]

Column1   -0.957277
Column2    0.050216
Column3    0.375921
Column4    0.420434
Name: A, dtype: float64

In [28]:
df.loc["A","Column1"]

-0.9572769073836257

In [29]:
df.loc["B","Column2"]

1.121641501647012

In [30]:
df.loc[["A","B"],["Column1","Column2"]]

    Column1   Column2
A -0.957277  0.050216
B  0.579557  1.121642